---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInView
source: html/62e25648-cedf-eac3-3c3f-4f3873cfe87c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInView Property

Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteInView { get; }
```